bit-finance/DataProcessors/бит_РабочееМестоКазначея.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_РабочееМестоКазначея</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Comment>Компоновщик</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикАнализ</Name>
					<Comment>Компоновщик анализ</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтображенияПериодов</Name>
					<Comment>Режим отображения периодов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтображенияСчетов</Name>
					<Comment>Режим отображения счетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйДень</Name>
					<Comment>Оперативный день</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСообщений</Name>
					<Comment>Режим сообщений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньРаскрытияСчетов</Name>
					<Comment>Уровень раскрытия дерева счетов по-умолчанию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьПредельныеСрокиПлатежа</Name>
					<Comment>Выделять предельные сроки платежа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФормироватьПлатежныеПоручения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаПанелиТекущийДокумент</Name>
					<Comment>Высота панели "Текущий документ"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОстаткиПоНеоплаченнымЗаявкам</Name>
					<Comment>Выводить остатки по неоплаченным заявкам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПрогнозыПлатежей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьНеснижаемыеОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ПериодичностьРМК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьВыходныеДни</Name>
					<Comment>Выделять выходные дни</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыСумма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыМинимум</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыМаксимум</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыСреднее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОстатков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_РежимОтображенияОстатковДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписиРасчетыЧерезБанк</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыЗаписиДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписиРасчетыЧерезКассу</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыЗаписиДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСчета</Name>
							<Comment>Вид счета</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Comment>Счет</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bit-finance/DataProcessors/бит_РабочееМестоКазначея/Forms/ФормаНастройки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущийОбъект") Тогда
		// АПК:68-выкл
		ОбработкаОбъект = ДанныеФормыВЗначение(Параметры.ТекущийОбъект, Тип("ОбработкаОбъект.бит_РабочееМестоКазначея"));
		// АПК:68-вкл
		ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
	КонецЕсли; 
	
	Параметры.Свойство("ЦветБудущий",	  ЦветБудущий);
	Параметры.Свойство("ЦветВыходной",	  ЦветВыходной);
	Параметры.Свойство("ЦветЗапрет",	  ЦветЗапрет);
	Параметры.Свойство("ЦветИнформация",  ЦветИнформация);
	Параметры.Свойство("ЦветОперативный", ЦветОперативный);
	Параметры.Свойство("ЦветПрошлый",	  ЦветПрошлый);

	ЗаполнитьСписокРежимовОстатков(); 
		
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
	ИспользоватьПрогнозы = ПолучитьФункциональнуюОпцию("бит_кзн_ИспользоватьПрогнозыПлатежейИПоступлений");
	
	Если НЕ ИспользоватьПрогнозы Тогда
		Элементы.ВыводитьПрогнозыПлатежей.Видимость = Ложь;
		Объект.ВыводитьПрогнозыПлатежей 			= Ложь;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОстатковПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОстатковОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Информация".
// 
&НаКлиенте
Процедура ЦветИнформацияПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветИнформация");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Прошлое".
// 
&НаКлиенте
Процедура ЦветПрошлыйПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветПрошлое");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Настоящее".
// 
&НаКлиенте
Процедура ЦветОперативныйПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветНастоящее");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Будущее".
// 
&НаКлиенте
Процедура ЦветБудущийПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветБудущее");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Запрет".
// 
&НаКлиенте
Процедура ЦветЗапретПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветЗапрет");
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "Цвет_Выходной".
//
&НаКлиенте
Процедура Цвет_ВыходнойПриИзменении(Элемент)
	
	ИзменениеЦвета("ЦветВыходной");
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "ВысотаПанелиТекущийДокумент".
// 
&НаКлиенте
Процедура ВысотаПанелиТекущийДокументПриИзменении(Элемент)
	
	ИзмененРазмер = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - действие команды "Готово".
// 
&НаКлиенте
Процедура Готово(Команда)
	
	Отказ = Ложь;
	Если НЕ ПериодЗаполненПравильно(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;

	Если Объект.ВыделятьВыходныеДни И НЕ ЗначениеЗаполнено(Объект.Календарь) Тогда
		ТекстПояснения = НСтр("ru = 'Для выделения выходных дней необходимо выбрать производственный календарь.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , "КОРРЕКТНОСТЬ", НСтр("ru = 'Календарь'"),,, ТекстПояснения);	
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Календарь", "Объект", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("Команда"      ,"ОК");
	ПараметрыПередачи.Вставить("ТекущийОбъект",Объект);
	ПараметрыПередачи.Вставить("ИзмененЦвет"  ,ИзмененЦвет);
	ПараметрыПередачи.Вставить("ИзмененРазмер",ИзмененРазмер);
	
	ПараметрыПередачи.Вставить("ЦветБудущий",	  ЦветБудущий);
	ПараметрыПередачи.Вставить("ЦветВыходной",	  ЦветВыходной);
	ПараметрыПередачи.Вставить("ЦветЗапрет",	  ЦветЗапрет);
	ПараметрыПередачи.Вставить("ЦветИнформация",  ЦветИнформация);
	ПараметрыПередачи.Вставить("ЦветОперативный", ЦветОперативный);
	ПараметрыПередачи.Вставить("ЦветПрошлый",	  ЦветПрошлый);
	
	Закрыть(ПараметрыПередачи);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьПериод(Команда)
	
	Диалог 			= Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период 	= Новый СтандартныйПериод(Объект.НачалоПериода, КонецДня(Объект.КонецПериода));
	РезультатВыбора = Ждать Диалог.РедактироватьАсинх();

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачалоПериода = РезультатВыбора.ДатаНачала;
	Объект.КонецПериода  = РезультатВыбора.ДатаОкончания;
	
	УстановитьЗаголовокФормы(ЭтотОбъект); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Форма)

	Объект = Форма.Объект;

	ЗаголовокОтчета = СтрШаблон(НСтр("ru='Рабочее место казначения %1';en='Workplace kaznacheniya %1'"),
		БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Объект.НачалоПериода, Объект.КонецПериода));
	
	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры

// Процедура заполняет список режимов остатков.
// 
// Параметры:
//  Нет
// 
&НаСервере
Процедура ЗаполнитьСписокРежимовОстатков()

КонецПроцедуры // ЗаполнитьСписокРежимовОстатков()

// Процедура обрабатывает изменение цвета. 
// Выполняется преобразование в HEX и установка полученного значения в реквизит объекта.
// 
// Параметры:
//  ИмяРеквизитаЦвет  - Строка
// 
&НаСервере
Процедура ИзменениеЦвета(ИмяРеквизитаЦвет)

	ИзмененЦвет = Истина;
	
КонецПроцедуры // ИзменениеЦвета()

&НаКлиентеНаСервереБезКонтекста 
Функция ПериодЗаполненПравильно(Форма)

	ЗаполненПравильно = Истина;
	
	Объект = Форма.Объект;
	Отказ  = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Начало периода';en='Start of the period'")); 
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
		#КонецЕсли
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru='Конец периода';en='End of period'")); 
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.КонецПериода",, Отказ);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.КонецПериода",, Отказ);
		#КонецЕсли
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Если Объект.КонецПериода < Объект.НачалоПериода Тогда
			ТекстСообщения = НСтр("ru='Период указан неверно. Дата начала больше даты окончания.';
								  |en='The period is incorrect. The start date is greater than the end date.'");
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
			#Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.НачалоПериода",, Отказ);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли; 
	
	Если Отказ Тогда
		ЗаполненПравильно = Ложь;
	КонецЕсли;  
	
	Возврат ЗаполненПравильно; 

КонецФункции // ПериодЗаполненПравильно()

#КонецОбласти
